Repository: Zhuma014/OrgOptimize_Diploma
Catalog: lib/l10n/app_*.arb
Languages: kk

# registration
source: Sign Up
kk: Тіркелу

# login
source: Sign In
kk: Кіру

# action_login
source: Sign In
kk: Кіру

# action_signup
source: Sign Up
kk: Тіркелу

source: Full name
kk: Толық аты-жөні

source: Email
kk: Пошта

source: Password
kk: Құпия сөз

source: Forgot password?
kk: Құпия сөз ұмыттыңыз?

# enter_correct_email
source: Enter a correct email
kk: Дұрыс пошта енгізіңіз

# enter_valid_password
source: The password must contain at least 8 characters (including letters, numbers, symbols)
kk: Құпия сөз кемінде 8 таңбадан тұрады (әріптерді, сандарды, шартты белгілер қосқанда)

source: Success
kk: Жетістік

source: Member
kk: Мүше

source: Club
kk: Клуб

# slogan
source: A hub for kindred spirits
kk: Ортақ мақсаттар жиынтығы

# birthday
source: Date of birth
kk: Туған күні

# name_of_the_club
source: Name of a club
kk: Клуб атауы

# login_or_create_account
source: Login or create an account
kk: Кіру немесе тіркелу жасаңыз

# login_to_account
source: Log in to your account
kk: Аккаунтқа кіріңіз

source: Home
kk: Басты

source: Chat
kk: Чат

source: Title
kk: Атауы

source: Description
kk: Сипаттама

source: Date
kk: Күні

source: Location
kk: Орналасуы

source: My Events
kk: Менің оқиғаларым

# upcoming_events
source: Upcoming Events of the Club
kk: Алдағы Оқиғалар

source: Get Started
kk: Бастау

source: Calendar
kk: Күнтізбе

source: Profile
kk: Профиль

source: Please, fill all fields
kk: Барлық өрістерді толтырыңыз

source: Personal data
kk: Жеке деректер

# action_logout
source: Log out
kk: Шығу

# logout_title
source: Sign out
kk: Шығу

# logout_from_profile
source: Are you sure you want to log out?
kk: Жүйеден шығуға сенімдісіз бе?

source: Interface language
kk: Интерфейс тілі

# select_language
source: Choose language:
kk: Тілді таңдаңыз:

source: Unknown error
kk: Белгісіз қате

# action_cancel
source: Cancel
kk: Болдырмау

source: Settings
kk: Баптаулар

# create_event
source: Create an event
kk: Оқиға жасау

source: Save
kk: Сақтау

source: Join the club
kk: Клубқа қосылу

source: Menu
kk: Мәзір

# really_want_to_join
source: Do you really want to join this club?
kk: Сіз шынымен де осы клубқа қосылғыңыз келе ме?

source: Join
kk: Қосылу

# request_pending
source: Your join request is pending.
kk: Сіздің қосылу өтінішіңіз қаралуда.

source: No clubs available
kk: Клубтар жоқ

source: Admin
kk: Админ

source: Requested
kk: Сұралды

# create_club
source: Create a Club
kk: Клуб құру

source: Create
kk: Құру

source: Club created successfully
kk: Клуб сәтті құрылды

# failed_club_create
source: Failed to create club
kk: Клуб құрылмады

# you_admin_of
source: You are admin of:
kk: Мына клубтардың админісіз:

source: No admin clubs
kk: Админ клубтары жоқ

source: Unknown Club
kk: Белгісіз Клуб

source: No description available
kk: Сипаттама жоқ

source: You are member of:
kk: Мына клубтардың мүшесісіз:

source: No member clubs
kk: Мүше клубтары жоқ

source: Your profile updated successfully
kk: Сіздің профиль сәтті жаңартылды

source: My
kk: Менің

source: Clubs
kk: Клубтар

source: All
kk: Барлығы

source: You don't have events
kk: Сізде оқиғалар жоқ

# club_or_my_event
source: Select Club or My Own Event
kk: Клубты немесе Жеке оқиғаны таңдаңыз

source: My Own Event
kk: Менің жеке оқиғам

# you_are_not_member
source: You are not a member of any club, please create your own club or be the member of
kk: Сіз ешқандай клубтың мүшесі емессіз, клуб құрыңыз не мүшесі болыңыз

source: Join Clubs
kk: Клубтарға қосылу

source: You are Member
kk: Сіз Мүшесіз

source: Requests
kk: Өтініштер

source: Members
kk: Мүшелер

source: Join Requests
kk: Қосылу Өтініштері

# no_requests
source: There are no requests
kk: Өтініштер жоқ

# loading_info
source: Loading user info...
kk: Пайдаланушы ақпараты жүктелуде...

# loadingerror
source: Error loading user info
kk: Ақпарат жүктелу қатесі

source: User
kk: Пайдаланушы

source: Unknown
kk: Белгісіз

source: Request ID
kk: Өтініш ID-і

source: Approved
kk: Қабылданды

source: Rejected
kk: Қабылданбады

source: User not found
kk: Пайдаланушы табылмады

source: Close
kk: Жабу

# error_occured
source: Error occurred
kk: Қате болды

source: Chat room updated successfully
kk: Чат бөлмесі сәтті жаңартылды

source: Failed to update chat room
kk: Чат бөлмесін жаңарту аяқталмады

source: Changed_successfully!
kk: Сәтті өзгерді!

source: Deleted successfully!
kk: Сәтті жойылды!

source: Left successfully!
kk: Сәтті қалдырылды!

source: Select users to add
kk: Қосу үшін пайдаланушылар таңдаңыз

# all_in_this_chat_room
source: All users are in this chat room.
kk: Барлық пайдаланушылар осы чат бөлмесінде.

source: Add Selected Users
kk: Таңдалған Пайдаланушыларды Қосыңыз

source: Chat Details
kk: Чат Мәліметтері

# no_details_for_private_chats
source: No details available for private chats.
kk: Жеке чаттар үшін мәліметтер жоқ.

source: No members found
kk: Мүшелер табылмады

source: Delete
kk: Жою

source: Make Owner
kk: Иесін Жасаңыз

source: Delete chat room
kk: Чат бөлмесін жою

source: Leave chat room
kk: Чат бөлмесінен шығыңыз

source: Club Chats
kk: Клуб Чаттары

source: Group Chats
kk: Топтық Чаттар

# no_group_chats
source: You do not have group chats,
kk: Сізде топтық чаттар жоқ,

source: start messaging
kk: хабар алмасуды бастау

source: Private Chats
kk: Жеке Чаттар

# no_private_chats
source: You do not have private chats,
kk: Сізде жеке чаттар жоқ,

# no_chat_rooms
source: No Chat Rooms Available
kk: Чат Бөлмелері Жоқ

# no_user_profile
source: No user profile found
kk: Пайдаланушы профилі табылмады

# start_conversation
source: Start a conversation...
kk: Әңгімені бастаңыз...

source: You
kk: Сіз

source: Loading...
kk: Жүктелуде...

source: Default Chat Room
kk: Әдепкі Чат Бөлмесі

source: Unnamed Chat Room
kk: Аталмаған Чат Бөлмесі

# admin_not_found
source: Admin profile not found
kk: Админ профилі табылмады

source: Created At
kk: Құрылды

source: Leave the club
kk: Клубтан шығу

source: Edit Club
kk: Клубты Өңдеу

source: Edit
kk: Өңдеу

source: No Title
kk: Атауы Жоқ

source: I will come
kk: Мен келемін

source: I will not come
kk: Мен келмеймін

source: Got it
kk: Түсіндім

# list_of_attendees
source: List of attendees for
kk: Қатысушылар тізімі

source: No attendances found
kk: Қатысушылар табылмады

source: Sign In Failed
kk: Жүйеге Кіру Өтпеді

source: Sign Up Successful
kk: Сәтті Тіркелдіңіз

source: Sign Up Failed
kk: Тіркелу Өтпеді

# select_user_to_message
source: Select a user to message
kk: Пайдаланушыны таңдау

source: No users found
kk: Пайдаланушылар табылмады

source: Create Chat Room
kk: Чат Бөлмесін Құрыңыз

source: Finish
kk: Аяқтау
